In [1]:
#Pandas는 데이터 파일 읽어서 데이터프레임만들 수 있음
##CSV
##Excel
##HTML
##JSON
##HDF5
##SAS
##STATA
##SQL

In [7]:
# %%writefile 명령 : sample data로 사용할 CSV파일을 %%writefile 매직명령으로 만들기
!rm -rf sample?.*

'rm'은(는) 내부 또는 외부 명령, 실행할 수 있는 프로그램, 또는
배치 파일이 아닙니다.

In [8]:
%%writefile sample1.csv
c1, c2, c3
1, 2, one
2, 6, two
3, 7, three

Overwriting sample1.csv

In [9]:
# CSV 파일 입력 : CSV 파일로부터 데이터 읽어 데이터프레임만들때
pd.read_csv('sample1.csv')

   c1   c2      c3
0   1    2     one
1   2    6     two
2   3    7   three

In [25]:
%%writefile sample2.csv
1, 3, one
2, 2, two
3, 5, three

Overwriting sample2.csv

In [34]:
pd.read_csv('sample2.csv', names=['c1', 'c2', 'c3'])

   c1  c2      c3
0   1   3     one
1   2   2     two
2   3   5   three

In [48]:
#특정 열을 행 인덱스로 지정
pd.read_csv('sample1.csv', index_col='c1')

     c2      c3
c1
1     2     one
2     6     two
3     7   three

In [55]:
%%writefile sample3.txt
c1        c2        c3        c4
0.179181 -1.538472  1.347553  0.43381
1.024209  0.087307 -1.281997  0.49265
0.417899 -2.002308  0.255245 -1.10515

Overwriting sample3.txt

In [56]:
#확장자 CSV아닌 경우, 데이터 구분하느 구분자 쉼표 또는 sep인수
##구분자가 공백이면 \s+라는 정규식 문자열 사용
pd.read_table('sample3.txt', sep = '\s+')

         c1        c2        c3       c4
0  0.179181 -1.538472  1.347553  0.43381
1  1.024209  0.087307 -1.281997  0.49265
2  0.417899 -2.002308  0.255245 -1.10515

In [74]:
%%writefile sample4.txt
파일 제목: sample4.txt
데이터 포맷의 설명:
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Overwriting sample4.txt

In [96]:
#자료 파일 중에 건너 뛰어야 할 행이 있으면 skiprows 인수를 사용
pd.read_csv('sample4.txt', skiprows=[0,1]) #0,1행 skip

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [97]:
%%writefile sample5.csv
c1, c2, c3
1, 1.11, one
2, 2.22, two
누락, 3.33, three

Writing sample5.csv

In [106]:
#특정값을 NaN으로 취급하려면 na_values인수에 NaN값으로 취급할 값 삽입
df = pd.read_csv('sample5.csv', na_values=['누락'])
df

    c1    c2      c3
0  1.0  1.11     one
1  2.0  2.22     two
2  NaN  3.33   three

In [11]:
#CSV 파일 출력 : 파이썬의 데이터프레임 값 > CSV 파일 출력 : to_csv()
df.to_csv('sample6.csv')

NameError: name 'df' is not defined

In [112]:
!type sample6.csv # 파일의 내용 확인

,c1, c2, c3
0,1.0,1.11, one
1,2.0,2.22, two
2,,3.33, three

In [127]:
#sep인수로 구분자 바꿀 수 있음
df.to_csv('sample7.txt', sep='|')

In [129]:
!type sample7.txt

|c1| c2| c3
0|1.0|1.11| one
1|2.0|2.22| two
2||3.33| three

In [14]:
df.to_csv('sample8.csv', na_rep='누락')

NameError: name 'df' is not defined

In [5]:
!type sample8.csv

,c1, c2, c3
0,1.0,1.11, one
1,2.0,2.22, two
2,tak,3.33, three

In [15]:
#index 지정
df.index = ['a', 'b', 'c']
df

NameError: name 'df' is not defined

In [147]:
#헤더 출력 여부
df.to_csv('sample9.csv', index=False, header=False)

In [148]:
!type sample9.csv

1.0,1.11, one
2.0,2.22, two
,3.33, three

In [16]:
#인터넷 상의 CSV 파일 입력
df = pd.read_csv("https://raw.githubusercontent.com/datascienceschool/docker_rpython/master/data/titanic.csv")

In [23]:
#display.max_rows로 보여줄 행의 수를 결정할 수 있다.
pd.set_option("display.max_rows", 20) # 앞뒤로 모두 20행만 보여준다.
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [24]:
#앞, 뒤 특정 갯수만 보고 싶으면 .head or .tail method 사용
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [26]:
df.tail(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [29]:
#인터넷 상의 데이터 베이스 자료 입력
##pandas_datareader 패키지의 'DataReader' -> 일부 인터넷 사이트 자료 바로 pandas로 읽을 수 있음
import datetime
dt_start = datetime.datetime(2015, 1, 1)
dt_end = "2016, 6, 30"

In [36]:
#data_source 인수로 데이터를 읽어올 웹 사이트를 지정한다. 
#데이터의 코드는 웹 사이트에서 검색하여 알아내야 한다
import pandas_datareader as pdr
gdp = pdr.get_data_fred('GDP', dt_start, dt_end)
gdp.tail()

                  GDP
DATE
2015-04-01  18219.405
2015-07-01  18344.713
2015-10-01  18350.825
2016-01-01  18424.283
2016-04-01  18637.253

In [40]:
inflation = pdr.get_data_fred(["GDP", "CPIAUCSL", "CPILFESL"], dt_start, dt_end)
inflation.tail()

                  GDP  CPIAUCSL  CPILFESL
DATE
2016-02-01        NaN   237.514   245.644
2016-03-01        NaN   237.990   245.964
2016-04-01  18637.253   238.835   246.467
2016-05-01        NaN   239.440   247.036
2016-06-01        NaN   240.144   247.435

In [41]:
!rm -rf sample?.*

'rm'은(는) 내부 또는 외부 명령, 실행할 수 있는 프로그램, 또는
배치 파일이 아닙니다.